In [24]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [25]:
tree_data=pd.read_csv('district wise rainfall normal.csv')

In [26]:
tree_data.head()

                 STATE_UT_NAME       DISTRICT  ANNUAL RAINFALL(mm)  oak
0  ANDAMAN And NICOBAR ISLANDS        NICOBAR              3000.00    0
1  ANDAMAN And NICOBAR ISLANDS  SOUTH ANDAMAN              3180.00    0
2  ANDAMAN And NICOBAR ISLANDS  N & M ANDAMAN              2913.30    0
3            ARUNACHAL PRADESH          LOHIT              3297.70    0
4            ARUNACHAL PRADESH     EAST SIANG              2910.18    0

In [27]:
tree_data.tail()

    STATE_UT_NAME        DISTRICT  ANNUAL RAINFALL(mm)  oak
636        KERALA          IDUKKI               3265.0    0
637        KERALA        KASARGOD               3350.0    0
638        KERALA  PATHANAMTHITTA               3133.0    0
639        KERALA         WAYANAD               2300.0    0
640   LAKSHADWEEP     LAKSHADWEEP               1750.0    0

In [28]:
tree_data.shape

(641, 4)

In [29]:
tree_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641 entries, 0 to 640
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   STATE_UT_NAME        641 non-null    object
 1   DISTRICT             641 non-null    object
 2   ANNUAL RAINFALL(mm)  641 non-null    float64
 3   oak                  641 non-null    int64
dtypes: float64(1), int64(1), object(2)
memory usage: 20.2+ KB

In [30]:
tree_data.isnull().sum()

STATE_UT_NAME          0
DISTRICT               0
ANNUAL RAINFALL(mm)    0
oak                    0
dtype: int64

In [31]:
tree_data.describe()

       ANNUAL RAINFALL(mm)         oak
count           641.000000  641.000000
mean           1332.429922    0.572543
std             899.780332    0.495096
min              80.000000    0.000000
25%             798.600000    0.000000
50%            1103.000000    1.000000
75%            1499.000000    1.000000
max           12000.000000    1.000000

In [32]:
tree_data.drop(['STATE_UT_NAME'], axis = 1)

           DISTRICT  ANNUAL RAINFALL(mm)  oak
0           NICOBAR              3000.00    0
1     SOUTH ANDAMAN              3180.00    0
2     N & M ANDAMAN              2913.30    0
3             LOHIT              3297.70    0
4        EAST SIANG              2910.18    0
..              ...                  ...  ...
636          IDUKKI              3265.00    0
637        KASARGOD              3350.00    0
638  PATHANAMTHITTA              3133.00    0
639         WAYANAD              2300.00    0
640     LAKSHADWEEP              1750.00    0

[641 rows x 3 columns]

In [33]:
df=tree_data.drop(['DISTRICT','STATE_UT_NAME'], axis = 1)
df

     ANNUAL RAINFALL(mm)  oak
0                3000.00    0
1                3180.00    0
2                2913.30    0
3                3297.70    0
4                2910.18    0
..                   ...  ...
636              3265.00    0
637              3350.00    0
638              3133.00    0
639              2300.00    0
640              1750.00    0

[641 rows x 2 columns]

In [34]:
df['oak'].value_counts()

1    367
0    274
Name: oak, dtype: int64

In [35]:
X=df.drop(columns='oak',axis=1)
Y=df['oak']

In [36]:
print(X)

     ANNUAL RAINFALL(mm)
0                3000.00
1                3180.00
2                2913.30
3                3297.70
4                2910.18
..                   ...
636              3265.00
637              3350.00
638              3133.00
639              2300.00
640              1750.00

[641 rows x 1 columns]

In [37]:
print(Y)

0      0
1      0
2      0
3      0
4      0
      ..
636    0
637    0
638    0
639    0
640    0
Name: oak, Length: 641, dtype: int64

In [38]:
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.2, stratify=Y, random_state=2)

In [39]:
print(X.shape,X_train.shape,X_test.shape)

(641, 1) (512, 1) (129, 1)

In [40]:
model=LogisticRegression()

In [41]:
model.fit(X_train,Y_train)

LogisticRegression()

In [42]:
X_train_prediction=model.predict(X_train)
training_data_accuracy=accuracy_score(X_train_prediction,Y_train)

In [43]:
print('accuracy on training data : ',training_data_accuracy)

accuracy on training data :  0.771484375

In [44]:
X_test_prediction=model.predict(X_test)
test_data_accuracy = accuracy_score(X_test_prediction, Y_test)

In [45]:
print('accuracy on test data : ',test_data_accuracy)

accuracy on test data :  0.8062015503875969

In [48]:
input_data = (2300)
input_data_as_numpy_array=np.asarray(input_data)
input_data_reshaped=input_data_as_numpy_array.reshape(1,-1)
prediction = model.predict(input_data_reshaped)
print(prediction)

if(prediction[0]==0):
    print('We cannot plant oak tree in this region try another tree')
  
else:
    print('We can plant oak tree in this area')

[0]
We cannot plant oak tree in this region try another tree